""" Сумма квадратов первых десяти натуральных чисел равна
12 + 22 + ... + 102 = 385
Квадрат суммы первых десяти натуральных чисел равен
(1 + 2 + ... + 10)2 = 552 = 3025
Следовательно, разность между суммой квадратов и квадратом суммы первых десяти натуральных чисел
составляет 3025 − 385 = 2640.
Найдите разность между суммой квадратов и квадратом суммы первых ста натуральных чисел."""
summa_1 = 0
summa_2 = 0
summa_m = 0
for n in range(101):
    summa_1 += n**2
for m in range(101):
    summa_m += m
summa_2 = summa_m**2
print("Ответ задача №6:", summa_2 - summa_1)


"""Выписав первые шесть простых чисел, получим 2, 3, 5, 7, 11 и 13. Очевидно, что 6-ое простое число - 13.

Какое число является 10001-ым простым числом?
"""
counter = 2
n = 10001
for i in range(3, 1000000, 2):
    k = 1
    while k < i:
        k += 2
        if i % k == 0:
             break
        if k + 2 == i:
            counter += 1
    if counter == n:
        print("Ответ задача №7:", i)
        break

"""Наибольшее произведение четырех последовательных цифр в нижеприведенном 1000-значном числе равно 9 × 9 × 8 × 9 = 5832.
Найдите наибольшее произведение тринадцати последовательных цифр в данном числе.
"""
a = list(str(7316717653133062491922511967442657474235534919493496983520312774506326239578318016984801869478851843))
b = list(str(8586156078911294949545950173795833195285320880551112540698747158523863050715693290963295227443043557))
c = list(str(6689664895044524452316173185640309871112172238311362229893423380308135336276614282806444486645238749))
d = list(str(3035890729629049156044077239071381051585930796086670172427121883998797908792274921901699720888093776))
e = list(str(6572733300105336788122023542180975125454059475224352584907711670556013604839586446706324415722155397))
f = list(str(5369781797784617406495514929086256932197846862248283972241375657056057490261407972968652414535100474))
g = list(str(8216637048440319989000889524345065854122758866688116427171479924442928230863465674813919123162824586))
l = list(str(17866458359124566529476545682848912883142607690042242190226710556263211111093705442175069416589604080))
m = list(str(7198403850962455444362981230987879927244284909188845801561660979191338754992005240636899125607176060))
s = list(str(588611646710940507754100225698315520005593572972571636269561882670428252483600823257530420752963450))

a_chisla = [int(item) for item in a]
b_chisla = [int(item) for item in b]
c_chisla = [int(item) for item in c]
d_chisla = [int(item) for item in d]
e_chisla = [int(item) for item in e]
f_chisla = [int(item) for item in f]
g_chisla = [int(item) for item in g]
l_chisla = [int(item) for item in l]
m_chisla = [int(item) for item in m]
s_chisla = [int(item) for item in s]
all_chisla = a_chisla + b_chisla + c_chisla + d_chisla + e_chisla + f_chisla + g_chisla + l_chisla + m_chisla + s_chisla
total_1 = 1
check = 1
summa = 0
i = 0
for k in range(1000):
    while check <= 13:
        total_1 *= all_chisla[i]
        i += 1
        check += 1
        if i >= len(all_chisla):
            break
    check = 1
    i -= 12
    if summa < total_1:
        summa = total_1
    total_1 = 1
print("Ответ задача №8", summa)
