"""Задание:
- Написать программу которая выводит на экран надпись: "Вася очень умный"."""

# Code here
print("Вася очень умный")