"""Задание:
Сейчас 3126 год. Мой друг родился 8 лет назад. Написать программу выводящую на экран 
год рождения моего друга в формате.

Пример:
"Мой друг родился в 3120 году."""

def year(x):
    y=3126-x
    print("Мой друг родился в", y, "году")

year(10)