"""Задание:
Напиши программу, которая выводит на экран надпись: "Python. Learn once- use anywhere" 10 раз.

Условие:
Команда print () должна использоваться только раз. """

print("Python. Learn once- use anywhere\n"*10)

