"""Задание:
Написать программу, выводящую на экран надпись "Элли самая красивая" 5 раз.
Пример:
Элли самая красивая
Элли самая красивая
Элли самая красивая
Элли самая красивая
Элли самая красивая """

print("Элли самая красивая\n"*5)


