"""Задание:
Дана переменная number.
Напиши программу, которая выводит на экран квадрат этой переменной."""

number=int(input())
y=number*2
print(y)