"""Задание:
Выведи на экран длину окружности, рассчитанную по формуле: L = 2*Pi*radius.
Pi= 3,14"""

r=int(input())

L = 2*3.14*r
print(L)
