"""Написать программу что бы она:
- выводила на экран строку "Число меньше 5"
если переменная n меньше 5.
- выводила строку "Число больше 5"
если переменная n больше 5.
- выводила строку "Число равно 5"
если переменая n равна 5."""

n=7

if n < 5:
    print("Число меньше 5")
if n > 5:
    print("Число больше 5")
if n == 5:
    print("Число равно 5")
